src/InformationRegisters/ИсторияСостоянийОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийОборудования</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрепленоЗа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/УправлениеОборудованиемСервер/Ext/Module.bsl
Функция ПолучитьТекущееСостояниеОборудования(Оборудование, МоментПолучения, ИсключаемыйРегистратор = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Оборудование) Тогда
		Сообщить("Не заполнено оборудование.");
	    Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МоментПолучения) Тогда
		Сообщить("Не заполнен момент получения.");
	    Возврат Неопределено;
	КонецЕсли; 
	
	УсловиеСреза = "Оборудование = &Оборудование";

	Если ЗначениеЗаполнено(ИсключаемыйРегистратор) Тогда
		УсловиеСреза = УсловиеСреза + " И Регистратор <> &ИсключаемыйРегистратор";
	КонецЕсли;
	
	ИсходныйПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсторияСостоянийОборудованияСрезПоследних.Состояние КАК Состояние,
			|	ИсторияСостоянийОборудованияСрезПоследних.ЗакрепленоЗа КАК ЗакрепленоЗа
			|ИЗ
			|	РегистрСведений.ИсторияСостоянийОборудования.СрезПоследних(&МоментПолучения, " + УсловиеСреза + ") КАК ИсторияСостоянийОборудованияСрезПоследних";
		
		Запрос.УстановитьПараметр("МоментПолучения", МоментПолучения);
		Запрос.УстановитьПараметр("Оборудование", Оборудование);
		Если ЗначениеЗаполнено(ИсключаемыйРегистратор) Тогда
			Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
		КонецЕсли;
	
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
	Исключение
	    Сообщить("Не удалось получить текущее состояние оборудования. "	+ ОписаниеОшибки());			
		Возврат Неопределено;     
		
	КонецПопытки;  
	
	УстановитьПривилегированныйРежим(ИсходныйПривилегированныйРежим);
	
	СостояниеОборудования = Новый Структура;
	Если Не Выборка.Следующий() Тогда
		СостояниеОборудования.Вставить("Состояние", Перечисления.СостоянияОборудования.НаСкладе);  
		СостояниеОборудования.Вставить("ЗакрепленоЗа", Справочники.Сотрудники.ПустаяСсылка()); 
		Возврат СостояниеОборудования;
	КонецЕсли;
	
	СостояниеОборудования.Вставить("Состояние", Выборка.Состояние);  
	СостояниеОборудования.Вставить("ЗакрепленоЗа", Выборка.ЗакрепленоЗа); 

	Возврат СостояниеОборудования;
КонецФункции

Функция ПолучитьДанныеЗаявкиДляРаботыСОборудованием(Заявка) Экспорт
	Если Не ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не заполнена заявка.");
	    Возврат Неопределено;
	КонецЕсли; 
	
    Попытка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ITЗаявка.Заявитель КАК Заявитель,
		|	ITЗаявка.Оборудование КАК Оборудование,
		|	ITЗаявка.ТекущийСтатус КАК ТекущийСтатус,
		|	ITЗаявка.Исполнитель КАК Исполнитель
		|ИЗ
		|	Документ.ITЗаявка КАК ITЗаявка
		|ГДЕ
		|	ITЗаявка.Ссылка = &Заявка
		|	И ITЗаявка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	
	Исключение
		Сообщить("Не удалось получить данные заявки. "	+ ОписаниеОшибки());			
    	Возврат Неопределено;  
	КонецПопытки;
	
	ДанныеЗаявки = Новый Структура;

	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗаявки.Вставить("Заявитель", Выборка.Заявитель);
	ДанныеЗаявки.Вставить("Оборудование", Выборка.Оборудование);
	ДанныеЗаявки.Вставить("ТекущийСтатус", Выборка.ТекущийСтатус);
	ДанныеЗаявки.Вставить("Исполнитель", Выборка.Исполнитель); 
	
	Возврат ДанныеЗаявки;
КонецФункции

Функция ЕстьЗавершеннаяОперацияПоОборудованию(Заявка) Экспорт

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИсторияСостоянийОборудованияСрезПоследних.Оборудование КАК Оборудование
			|ИЗ
			|	РегистрСведений.ИсторияСостоянийОборудования.СрезПоследних(
			|		&МоментПроверки, ) КАК ИсторияСостоянийОборудованияСрезПоследних
			|ГДЕ
			|	ИсторияСостоянийОборудованияСрезПоследних.Заявка = &Заявка
			|	И ИсторияСостоянийОборудованияСрезПоследних.Состояние = &Состояние";

		Запрос.УстановитьПараметр("МоментПроверки", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Заявка", Заявка);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияОборудования.Используется);

		Выборка = Запрос.Выполнить().Выбрать();

		Возврат Выборка.Следующий();

	Исключение
		Сообщить("Не удалось проверить операции по оборудованию. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции
